# Pandas Tips: `astype()`

In [5]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dghos\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dghos\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dghos\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dghos\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\dghos\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

Check your pandas version to ensure similar behavior. 

_Version 2.1.1 was released September 2023._

In [2]:
pd.__version__

'1.5.3'

### Create Data

In [24]:
data_dict = {
    'cost': [25, 19, 88],
    'sale_price' : [20, 19, 59]
}

df = pd.DataFrame(data=data_dict)

In [4]:
df.head()

   cost  sale_price
0    25          20
1    19          19
2    88          59

## Basics

### Check columns types: `.dtypes`

In [5]:
df.dtypes

cost          int64
sale_price    int64
dtype: object

### Change data type of entire dataframe

In [6]:
df.astype('float')

   cost  sale_price
0  25.0        20.0
1  19.0        19.0
2  88.0        59.0

In [7]:
df.astype('float').dtypes

cost          float64
sale_price    float64
dtype: object

### Change the data type of one column

In [8]:
df.head()

   cost  sale_price
0    25          20
1    19          19
2    88          59

In [9]:
df.sale_price.dtypes

dtype('int64')

In [10]:
df.sale_price.astype(float).to_frame()

   sale_price
0        20.0
1        19.0
2        59.0

In [11]:
df

   cost  sale_price
0    25          20
1    19          19
2    88          59

In [12]:
df.sale_price.astype(float).dtypes

dtype('float64')

## $\star$ Level Up $\star$

### Changing the data type of one column with the mapper

Just like with other pandas methods (like `rename`), you can pass a mapper to `astype` in the style:
<br><br>
<center>{ column_name : new_data_type }</center>

In [13]:
df.head()

   cost  sale_price
0    25          20
1    19          19
2    88          59

In [17]:
df.astype({'sale_price': 'float'})

   cost  sale_price
0    25        20.0
1    19        19.0
2    88        59.0

In [18]:
df

   cost  sale_price
0    25          20
1    19          19
2    88          59

In [25]:
df.astype({'sale_price': float}).dtypes

cost            int64
sale_price    float64
dtype: object

### Changing multiple data types with the mapper

Add more columns to the dataframe.

In [26]:
df['discount'] = ['True', 'False', 'True']
df['in_stock'] = [0, 1, 1]

In [27]:
df.head()

   cost  sale_price discount  in_stock
0    25          20     True         0
1    19          19    False         1
2    88          59     True         1

In [28]:
df.dtypes.to_frame()

                 0
cost         int64
sale_price   int64
discount    object
in_stock     int64

Change various data types at once.

In [29]:
df.astype(
    {
        'sale_price': float,
        'discount': bool,
        'in_stock': bool
    }
)

   cost  sale_price  discount  in_stock
0    25        20.0      True     False
1    19        19.0      True      True
2    88        59.0      True      True

In [30]:
df.astype(
    {
        'sale_price': float,
        'discount': bool,
        'in_stock': bool
    }
).dtypes

cost            int64
sale_price    float64
discount         bool
in_stock         bool
dtype: object